[
  {
    "_id": "68766f1226a2e74b39bf05a9",
    "url": "https://www.a-speakers.com/speakers/alexis-zahner/",
    "description": "Transformation Expert",
    "fee_range": "Request price and availability",
    "full_bio": "Transformation Expert\n\nUnlock your organization's full potential with Alexis Zahner, a renowned keynote speaker. With a proven track record in driving transformation and achieving remarkable results, Alexis delivers insightful, actionable strategies that propel businesses to new heights. Don't miss this opportunity to harness the power of innovation, resilience, and strategic excellence. Book Alexis Zahner today and watch your organization thrive!\n\nWith a diverse and accomplished professional background spanning various industries, Alexis Zahner stands as a beacon of strategic wisdom and transformational leadership. As a renowned keynote speaker, she brings her wealth of knowledge and expertise to organizations worldwide, igniting the spark of innovation and excellence within their teams.\nAlexis's journey through local government, marketing, media consultancy, and management at global brand Patagonia has shaped her into a visionary strategist. Her experiences, both the highs and lows, have fueled her passion for a more conscious, mindful, and human-centric approach to leadership.\nAs a keynote speaker, Alexis Zahner embodies the essence of leadership excellence. Her presentations are not just informative but also transformative, leaving audiences with practical tools and insights to excel in their professional endeavors. She empowers organizations to navigate change, achieve remarkable results, and instill a culture of innovation.\nTo harness the power of Alexis Zahner's expertise and inspire your team to greatness, book Alexis Zahner today. Join the ranks of organizations that have experienced the positive impact of her keynotes and unlock your path to excellence. Alexis Zahner: Your guide to a future of leadership that drives success and fulfillment.",
    "image_url": "https://www.a-speakers.com/media/pojozb5o/alexis-zahner-hero.jpg",
    "job_title": "Experience transformational leadership with Alexis Zahner, renowned for driving organizations to peak performance.",
    "keynotes": [
      {
        "title": "Strategic Vision: Leading with Empathy and Purpose",
        "description": "Unlock the secrets of Human Leadership with Alexis Zahner, a visionary strategist and acclaimed keynote speaker. In this captivating keynote presentation, Alexis will guide your organization on a transformative journey towards authentic and empathetic leadership.\nDrawing upon her extensive experience spanning diverse industries and global leadership roles, Alexis brings a wealth of knowledge to the stage. She will inspire and empower your audience with practical insights, actionable strategies, and real-world examples.\nAudience Takeaways:\nUnlock the secrets of Human Leadership\nEnhance team engagement and productivity\nMaster effective, empathetic communication",
        "id": "strategic-vision-leading-with-empathy-and-purpose"
      }
    ],
    "location": "Australia",
    "name": "Alexis Zahner",
    "reviews": [],
    "scraped_at": "2025-07-15T15:09:06.290000",
    "topics": [
      "Human-centric leadership",
      "Innovation",
      "Inspiration",
      "Leadership and Change",
      "Leadership development",
      "Motivation",
      "Organizational Change",
      "Organizational culture",
      "Organizational development",
      "Peak Performance",
      "Resilience"
    ],
    "videos": [
      {
        "title": "Why we need more HUMAN at work! Presented by Human Leaders, facilitated by Alexis Zahner",
        "description": "Watch Alexis Zahner in action",
        "url": "https://www.youtube-nocookie.com/embed/ZxlK_6fGxgQ?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=ZxlK_6fGxgQ&modestbranding=1&playsinline=1",
        "video_id": "player-59e7c92e-915e-4265-bf56-3c44e3731f33",
        "thumbnail": "https://img.youtube.com/vi/ZxlK_6fGxgQ/sddefault.jpg"
      },
      {
        "url": "https://www.youtube-nocookie.com/embed/ZxlK_6fGxgQ?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=ZxlK_6fGxgQ&modestbranding=1&playsinline=1",
        "video_id": "player-59e7c92e-915e-4265-bf56-3c44e3731f33",
        "thumbnail": "https://img.youtube.com/vi/ZxlK_6fGxgQ/sddefault.jpg"
      }
    ],
    "why_book_points": [
      "Strategic Visionary: Alexis Zahner offers invaluable insights into strategic thinking, equipping your team with the tools to navigate complex challenges and drive growth."
    ]
  },
  {
    "_id": "68766f1426a2e74b39bf05b2",
    "url": "https://www.a-speakers.com/speakers/alf-rehn/",
    "description": "Turning Bold and Provocative Ideas into Winning Solutions",
    "fee_range": "Request price and availability",
    "full_bio": "Turning Bold and Provocative Ideas into Winning Solutions\n\nUnlock innovation and inspire change with Alf Rehn — a globally recognized expert in creativity, leadership, and business growth. As a bestselling author and thought leader, Alf empowers organizations to challenge outdated thinking, overcome innovation fatigue, and drive impactful results with fresh ideas and bold strategies.\n\nAlf Rehn is a globally recognized innovation expert, celebrated for his bold insights, unconventional ideas, and ability to challenge traditional thinking. With a unique approach that blends academic expertise with real-world experience, he inspires organizations to break free from outdated strategies and embrace fresh perspectives.\nAs a bestselling author of 19 influential books, including\nInnovation for the Fatigued\nand\nDangerous Ideas\n, Alf equips leaders with practical tools to overcome creative stagnation, rethink leadership strategies, and unlock new growth opportunities. His work addresses critical challenges such as innovation fatigue and leadership paradoxes, providing actionable insights that drive impactful change.\nAlf’s academic achievements are equally impressive. Appointed as Finland’s youngest professor at just 31, he has since held esteemed positions in universities across Finland, Denmark, and Sweden. His expertise has earned him recognition on the\nThinkers50 Guru Radar\n, a prestigious list identifying the world’s leading management thought leaders.\nWith over 1,000 impactful keynotes delivered worldwide, Alf combines sharp insights with humor, storytelling, and real-world strategies that resonate with audiences. His engaging style challenges leaders to rethink assumptions, embrace unconventional thinking, and unlock new ideas that fuel innovation.\nAlf’s extensive experience as a corporate advisor further strengthens his ability to provide valuable solutions for organizations facing complex challenges. By combining strategic insights with practical frameworks, he empowers businesses to foster creativity, strengthen leadership, and drive sustainable growth.\nBook Alf Rehn for your event to inspire fresh thinking, challenge outdated strategies, and equip your organization with tools for innovation and growth.",
    "image_url": "https://www.a-speakers.com/media/lgrpxxg0/alf-rehn-bio.jpg",
    "job_title": "As a bestselling author and innovation expert, Alf Rehn helps businesses transform unconventional ideas into impactful solutions.",
    "keynotes": [
      {
        "title": "Moving minds with words",
        "description": "Alf Rehn’s keynotes offer fresh perspectives on innovation, leadership, and creativity, challenging audiences to rethink assumptions and embrace new ways of thinking. Drawing from his extensive background in academia, bestselling authorship, and corporate advising, Alf combines sharp insights with engaging storytelling to deliver impactful and memorable presentations.\nHis keynotes address key challenges organizations face today, such as overcoming innovation fatigue, unlocking creative potential, and navigating the complexities of leadership. By exploring how ingrained habits and outdated thinking can hinder progress, Alf provides practical insights to help organizations break free from these limitations and inspire change.\nAlf’s presentations often delve into the paradoxes of leadership — the challenge of being both thoughtful and decisive, open yet firm. He reveals how these tensions can stifle innovation if left unaddressed and offers strategies to help leaders strike the right balance.\nDelivered with humor, insightful anecdotes, and thought-provoking ideas, Alf’s keynotes engage audiences while equipping them with the tools to foster creativity, drive innovation, and build more dynamic and forward-thinking organizations.",
        "id": "moving-minds-with-words"
      }
    ],
    "location": "Denmark",
    "name": "Alf Rehn",
    "reviews": [],
    "scraped_at": "2025-07-15T15:09:08.111000",
    "topics": [
      "Author",
      "Branding",
      "Business",
      "Business Transformation",
      "Change Management",
      "Communication",
      "Company Structure",
      "Competitiveness",
      "Computer Technology",
      "Corporate Culture",
      "Creativity",
      "Culture and Society",
      "Digital Disruption",
      "Disruptive Innovation",
      "Entrepreneurship",
      "FinTech",
      "Food",
      "Future of Work",
      "Innovation",
      "Leadership",
      "Management",
      "Motivation",
      "Organizational culture",
      "Startups",
      "Strategy"
    ],
    "videos": [
      {
        "title": "A taste of leadership: Alf Rehn at TEDxUmeå",
        "description": "",
        "url": "https://www.youtube-nocookie.com/embed/BWBYIRdeTFQ?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=BWBYIRdeTFQ&modestbranding=1&playsinline=1",
        "video_id": "player-132dc640-5f56-4c67-8d7a-c53f4e615f85",
        "thumbnail": "https://img.youtube.com/vi/BWBYIRdeTFQ/sddefault.jpg"
      },
      {
        "url": "https://www.youtube-nocookie.com/embed/BWBYIRdeTFQ?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=BWBYIRdeTFQ&modestbranding=1&playsinline=1",
        "video_id": "player-132dc640-5f56-4c67-8d7a-c53f4e615f85",
        "thumbnail": "https://img.youtube.com/vi/BWBYIRdeTFQ/sddefault.jpg"
      },
      {
        "title": "Alf Rehn: Extreme consumers and fanatic fans",
        "description": "",
        "url": "https://www.youtube-nocookie.com/embed/BIm4lDq7aH0?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=BIm4lDq7aH0&modestbranding=1&playsinline=1",
        "video_id": "player-8d329169-84a0-4382-94e1-53df44fef2ac",
        "thumbnail": "https://img.youtube.com/vi/BIm4lDq7aH0/sddefault.jpg"
      },
      {
        "url": "https://www.youtube-nocookie.com/embed/BIm4lDq7aH0?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=BIm4lDq7aH0&modestbranding=1&playsinline=1",
        "video_id": "player-8d329169-84a0-4382-94e1-53df44fef2ac",
        "thumbnail": "https://img.youtube.com/vi/BIm4lDq7aH0/sddefault.jpg"
      }
    ],
    "why_book_points": [
      "Featured on Thinkers50 Guru Radar, Alf is recognized as a bold voice challenging outdated leadership and innovation strategies."
    ]
  },
  {
    "_id": "68766f1526a2e74b39bf05b6",
    "url": "https://www.a-speakers.com/speakers/alfie-joey/",
    "description": "Master of Expression",
    "fee_range": "Request price and availability",
    "full_bio": "Master of Expression\n\nUnlock success with Alfie Joey: A dynamic keynote speaker who marries humor and insight to revolutionize communication. Elevate team cohesion, ignite innovation, and boost motivation through powerful storytelling and actionable strategies. Alfie Joey delivers a transformative experience, leaving your audience inspired and equipped for lasting growth.\n\nAlfie Joey is a seasoned professional with a rich and diverse background that spans over two decades. With a remarkable career as an artist, broadcaster, podcaster, comedian, communication coach, and TedX speaker, Alfie has cultivated a unique set of skills that few possess. His ability to seamlessly transition between roles, from captivating comedian to insightful communication coach, reflects his versatility and depth of experience.\nHaving motivated and inspired audiences at TedX events, Alfie's expertise in communication and motivation is both proven and compelling. His proficiency in engaging and connecting with people has been honed through years of experience as a broadcaster, where he hosted a much-loved show on BBC radio for nearly 15 years. This Sony Award-nominated show is a testament to his ability to captivate listeners and deliver quality content consistently.\nAlfie's accomplishments extend to the entertainment and corporate sectors, where he has acted in sitcoms, performed as an impressionist, and MC'd events at prestigious venues such as Wembley Arena. His appearance on Britain's Got Talent (BGT) showcased his wide-reaching appeal and ability to captivate massive audiences.\nWith a background as a charity auctioneer, children's author, and motivator, Alfie's influence isn't confined to a single domain. His insights and experiences are translated into powerful keynote speeches that address the challenges organizations face. Alfie's talks empower teams to master communication, embrace innovation, and enhance collaboration.\nBooking Alfie Joey for your next event means gaining access to a dynamic speaker whose impact transcends traditional boundaries. His multi-faceted background, coupled with his proven ability to connect, entertain, and motivate, makes him an ideal choice for organizations seeking a unique and impactful keynote experience. Alfie Joey's ability to inspire positive change and lasting growth is what sets him apart, making him a valuable addition to any event.",
    "image_url": "https://www.a-speakers.com/media/zgaonocw/profilebiographyimage.jpg",
    "job_title": "Elevate your event with Alfie Joey, renowned TEDx speaker & communication coach, empowering teams to master impactful communication.",
    "keynotes": [
      {
        "title": "CHANGING LANES:",
        "description": "This keynote is an extension of Alfie's Ted X Talk. A common curse of modern life is getting stuck in a job/situation that makes you unhappy. What if changing career was as easy as changing lane on a motorway? What does it take to ‘make the jump’? Alfie answers these questions and shows us how he did it , many times.",
        "id": "changing-lanes"
      },
      {
        "title": "CREATIVITY:",
        "description": "Hard work or luck? Alfie gave this keynote at Bright Ideas Festival. It explores creativity, talent and hard work and explores the question, what does it take to make it.",
        "id": "creativity"
      },
      {
        "title": "Alfie Joey The Speak Easy Guy:",
        "description": "This is the age of the podcast and the panel. So many people and companies invest in the best microphones, studios and event spaces but invest little into honing those hosting, presenting or interviewing skills. Alfie has interviewed an incredible array of guests, (pop stars, politicians, oscar winners, Olympians, business champions...) both on BBC radio and on countless big stages ( From Wembley Arena to Sage Gateshead ....) . This exciting keynote explores what it takes to be a better presenter, podcaster or host and shows you how to make more impact as a guest.",
        "id": "alfie-joey-the-speak-easy-guy"
      }
    ],
    "location": "UK",
    "name": "Alfie Joey",
    "reviews": [],
    "scraped_at": "2025-07-15T15:09:09.487000",
    "topics": [
      "Charity Work",
      "Comedy",
      "Communication",
      "Empowerment",
      "Entertainment",
      "Humour",
      "Innovation",
      "Inspiration",
      "Motivation",
      "Storytelling"
    ],
    "videos": [
      {
        "title": "Changing Lanes | Alfie Joey | TEDxNewcastle",
        "description": "Watch Alfie Joey in action",
        "url": "https://www.youtube-nocookie.com/embed/HIlgL4A_kuc?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=HIlgL4A_kuc&modestbranding=1&playsinline=1",
        "video_id": "player-db2362a4-d4b3-4be3-bb98-21bd6444b8da",
        "thumbnail": "https://img.youtube.com/vi/HIlgL4A_kuc/sddefault.jpg"
      },
      {
        "url": "https://www.youtube-nocookie.com/embed/HIlgL4A_kuc?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=HIlgL4A_kuc&modestbranding=1&playsinline=1",
        "video_id": "player-db2362a4-d4b3-4be3-bb98-21bd6444b8da",
        "thumbnail": "https://img.youtube.com/vi/HIlgL4A_kuc/sddefault.jpg"
      }
    ],
    "why_book_points": [
      "Elevate Communication: Alfie Joey's keynotes empower teams with actionable communication tools, fostering better collaboration and engagement."
    ]
  },
  {
    "_id": "68766f1626a2e74b39bf05b9",
    "url": "https://www.a-speakers.com/speakers/alfonso-g-aguilar/",
    "description": "Notable composer Alfonso Aguilar transforms branding concepts with music",
    "fee_range": "Request price and availability",
    "full_bio": "Notable composer Alfonso Aguilar transforms branding concepts with music\n\nAlfonso taps into his musical gifts to introduce audiences to new ways of experiencing sound. From musical coding to artificial intelligence, he leverages new technology to raise awareness about the power of music to influence brand messaging. Breaking with traditional music composition, Alfonso elevates his work by introducing customers to innovative concepts designed to create an emotional connection with a brand. As a popular composer, he has worked with top brands in producing film scores, branding concepts, and soundtracks. Notably, he received a Public Choice Award for his score in the Netflix movie, Klaus.\n\nAlfonso G. Aguilar is a renowned film composer and musician who elevates brand awareness with unique musical messaging. He also founded Sounditi, a firm that develops artificial intelligence concepts for major brands, which seek unique music ID.\nKnown for his work on Oscar-nominated Klaus, Alfonso brings a depth of experience to keynote presentations. From writing scores for films to working with iconic entertainment figures to develop global projects, the composer offers an enlightening perspective on the way music impacts consumers and audiences.\nAs a music producer, Alfonso is responsible for the production of Abbey Road acoustics for “Guerra,” an album from artist Carlos Rivera, which achieved gold and platinum status. Recent works also include writing a musical film score for Nickelodeon’s Santiago of the Seas and Amazon’s El Cid series.\nUtilizing his in-depth knowledge about music, Alfonso G. Aguilar offers listeners a unique experience, which includes information on brand messaging, films, and soundtracks. His background integrating music to elevate a brand’s impact is revolutionizing the way audiences understand sound and its impact on consumers.\nAs a music innovator, Alfonso lifts audiences into a new awareness about music and its ability to influence how consumers feel about a brand or film.\nlfonso G. Aguilar",
    "image_url": "https://www.a-speakers.com",
    "job_title": "Alfonso G. Aguilar is a world-renowned musician and composer with unique understanding of brand messaging.",
    "keynotes": [
      {
        "title": "Speaking topics",
        "description": "Alfonso presents an insightful and inspiring keynote based on his knowledge about artificial intelligence, musical coding, and how to impact brand messages through music. Alfonso will also touch upon the following topics:\nEntrepreneurship\nMusic\nStartup",
        "id": "speaking-topics"
      }
    ],
    "location": "USA",
    "name": "Alfonso G. Aguilar",
    "reviews": [],
    "scraped_at": "2025-07-15T15:09:10.467000",
    "topics": [
      "Artificial Intelligence",
      "Branding",
      "Career",
      "Collaboration",
      "Creativity",
      "Digital Communication",
      "Digitalization",
      "Entrepreneurship",
      "Inspiration",
      "Knowledge Sharing",
      "Life Story",
      "Marketing",
      "Music",
      "Spain"
    ],
    "videos": [
      {
        "title": "Interview to ALFONSO G AGUILAR at Big Data Spain 2018",
        "description": "Watch Alfonso G. Aguilar in action",
        "url": "https://www.youtube-nocookie.com/embed/tOCX-hoOpc0?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=tOCX-hoOpc0&modestbranding=1&playsinline=1",
        "video_id": "player-ef840878-d3de-4cc8-ada9-4a7a40eb9aeb",
        "thumbnail": "https://img.youtube.com/vi/tOCX-hoOpc0/sddefault.jpg"
      },
      {
        "url": "https://www.youtube-nocookie.com/embed/tOCX-hoOpc0?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=tOCX-hoOpc0&modestbranding=1&playsinline=1",
        "video_id": "player-ef840878-d3de-4cc8-ada9-4a7a40eb9aeb",
        "thumbnail": "https://img.youtube.com/vi/tOCX-hoOpc0/sddefault.jpg"
      },
      {
        "title": "Música, Hipnosis y Emociones | Alfonso González Aguilar | TEDxUComillas",
        "description": "Watch Alfonso G. Aguilar in action",
        "url": "https://www.youtube-nocookie.com/embed/7h2gR5pvhpg?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=7h2gR5pvhpg&modestbranding=1&playsinline=1",
        "video_id": "player-966e4ac7-840f-4f9f-a77b-b907c281ed59",
        "thumbnail": "https://img.youtube.com/vi/7h2gR5pvhpg/sddefault.jpg"
      },
      {
        "url": "https://www.youtube-nocookie.com/embed/7h2gR5pvhpg?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=7h2gR5pvhpg&modestbranding=1&playsinline=1",
        "video_id": "player-966e4ac7-840f-4f9f-a77b-b907c281ed59",
        "thumbnail": "https://img.youtube.com/vi/7h2gR5pvhpg/sddefault.jpg"
      }
    ],
    "why_book_points": [
      "Listeners enjoy the way Alfonso introduces new musical concepts in a simple-to-understand presentation. His dynamic and unique keynotes are a refreshing way for audiences to understand how sound may positively impact brand messaging."
    ]
  },
  {
    "_id": "68766f1926a2e74b39bf05bd",
    "url": "https://www.a-speakers.com/speakers/ali-aslan/",
    "description": "International Journalist, Conference Moderator, TV Presenter, and Speaker",
    "fee_range": "Request price and availability",
    "full_bio": "International Journalist, Conference Moderator, TV Presenter, and Speaker\n\nAli Aslan is a master of many trades. As an internationally renowned and award-winning TV Presenter, Talk Show Host, Conference Moderator, Master of Ceremonies and Journalist, Ali Aslan has worked worldwide. From Berlin and Barcelona to Istanbul, New York, and Washington DC, he is a familiar face in big cities of the world. Those who have benefitted from his talent include global news networks such as Channel News Asia, Deutsche Welle TV, ABC News, and of course, CNN, the greatest of them all. You probably know Quadriga, which is watched by over 100 million people in hundreds of countries. Ali was once the host of this international affairs talk show.\n\nAslan is also one of the world’s most sought-after Moderators and Masters of Ceremonies of high-level international conferences & summits, including for the UN, the G20, the EU, the World Bank, the IMF and the OECD.\nAs a presenter known and respected globally, Ali has regularly moderated major conferences in various countries. In doing so, he has been privileged to share the international stage with big names, including Bill Clinton, Christine Lagarde, John McCain, Emmanuel Macron, and Madeleine Albright. Others include Sergey Lavrov, Justin Trudeau, and Angela Merkel, a former German Chancellor who served between 2005 and 2021. Unless you have a huge profile, you have zero chance of regulating conferences where such big names are involved. So, yes, you could safely claim that Aslan is a prominent figure when it comes to his trade.\nYou need to know that Aslan was once a policy and media advisor to Angela Merkel's administration, which is further proof of his prominent profile. When it comes to public speaking, people seek him like no other. He speaks on quite a number of issues, including media and politics in Germany and Europe as a whole. His perspective spans the US, Europe, the Middle East, journalism, and policy-making. He articulately analyzes international affairs like a real expert, whether he is moderating, interviewing, or giving keynotes.\nThanks to his achievements, Aslan was named a Young Leader by various organizations, including the Munich Security, the Bertelsmann Foundation, the BMW Foundation, and the American Council on Germany.",
    "image_url": "https://www.a-speakers.com/media/pktfcnyh/profilebiographyimage.jpg",
    "job_title": "Aslan, a former government media and policy advisor, is also a public speaker on European, Trans-Atlantic, and German affairs.",
    "keynotes": [
      {
        "title": "Keynote topics",
        "description": "Topics:\nJournalism\nMedia & policy advisor\nGerman affairs\nInternational affairs\nTrans-Atlantic relations",
        "id": "keynote-topics"
      }
    ],
    "location": "Germany",
    "name": "Ali Aslan",
    "reviews": [],
    "scraped_at": "2025-07-15T15:09:13.048000",
    "topics": [
      "Broadcast Media",
      "Government",
      "International Politics",
      "Journalism",
      "Knowledge",
      "Moderators",
      "Policy advisor",
      "Politics",
      "Politics & Issues",
      "Television"
    ],
    "videos": [
      {
        "title": "WPC 2021 - Intro Ali Aslan - Plenary session 15: Afghanistan",
        "description": "Watch Ali Aslan in action",
        "url": "https://www.youtube-nocookie.com/embed/A9aOazydeuo?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=A9aOazydeuo&modestbranding=1&playsinline=1",
        "video_id": "player-07fc8e81-0083-47b3-a6d7-60c107a57beb",
        "thumbnail": "https://img.youtube.com/vi/A9aOazydeuo/sddefault.jpg"
      },
      {
        "url": "https://www.youtube-nocookie.com/embed/A9aOazydeuo?controls=1&disablekb=1&enablejsapi=1&loop=1&playlist=A9aOazydeuo&modestbranding=1&playsinline=1",
        "video_id": "player-07fc8e81-0083-47b3-a6d7-60c107a57beb",
        "thumbnail": "https://img.youtube.com/vi/A9aOazydeuo/sddefault.jpg"
      }
    ],
    "why_book_points": [
      "Ali Aslan is a super competent speaker, moderator, and interviewer on a host of topics, including Trans-Atlantic relations, Middle East current affairs, European current events, and international affairs."
    ]
  }
]