[
  {
    "_id": "687691c326a2e74b39bf52a6",
    "speaker_id": "389198",
    "biography": "\"Science Bob \"​ Pflugfelder is a science communicator, teacher, maker, author, and presenter who knows how to make the world of science come alive in a big way. He regularly appears on ABC's \"Jimmy Kimmel Live,\" and \"Live With Kelly & Mark.\" He has also appeared on \"Join Or Die With Craig Ferguson,\" \"Good Morning America,\" \"The Today Show,\" and others, as well as guest starring as himself on several episodes of Nickelodeon's \"Nicky, Ricky Dicky, & Dawn.\" Pflugfelder has also appeared on television internationally in Japan, Rome, and Singapore and is the holder of five Guinness World Records.\nPflugfelder shares his excitement for science at many science and maker events, including The World Science Festival, The White House Science Fair, the USA Science & Engineering Festival, The Singapore Science Festival, World MakerFaire, and MakerFaire Rome.\nHis popular \"Nick & Tesla\" children's book series has encouraged many elementary and middle school students to read and build their own gadgets. To date, the series has been translated into 10 languages.\nArticles on Pflugfelder's experiments have appeared in People Magazine, Nickelodeon Magazine, Emmy Magazine, Popular Science, Disney's Family Fun, and WIRED.",
    "categories": [
      "Education",
      "Educational Motivational",
      "Family & Parenting",
      "Science",
      "STEM",
      "STEM Education",
      "Technology"
    ],
    "fee_range": {
      "live_event": "$10,000 - $20,000",
      "virtual_event": "$5,000 - $10,000"
    },
    "job_title": "Science Communicator, Teacher, Author & Television Personality",
    "location": "San Francisco, CA, USA",
    "name": "\"Science Bob\" Pflugfelder",
    "rating": {
      "average_rating": 5,
      "review_count": 2
    },
    "reviews": [
      {
        "rating": 5,
        "text": "The presentation was perfect for our audience and capped off our event with some fun style. Thanks to Bob for coming out to WI to give our families some laughter, fun, and showing his heart for science.",
        "author": "Foth"
      },
      {
        "rating": 5,
        "text": "Another incredible experience with All American Entertainment! The speakers were great and very motivational to our student audience and the service prior was just wonderful!",
        "author": "The Project Fibonacci® Foundation, Inc."
      }
    ],
    "scraped_at": "2025-07-15T17:37:07.559000",
    "speaking_topics": [
      {
        "title": "STEM (STEAM) EducationHow does the STEAM movement help young students prepare for 21st century skills?",
        "description": "How does the Scientific Method work and how can innovation, learning from failure, and following your passions change the world?"
      },
      {
        "title": "Science Demonstrations And InnovationsA program full of demonstrations, stories, and insights of how...",
        "description": "Science Demonstrations And InnovationsA program full of demonstrations, stories, and insights of how the Scientific Method brings about innovations to change the world and inspire others."
      }
    ],
    "url": "https://www.allamericanspeakers.com/speakers/389198/%22Science-Bob%22-Pflugfelder",
    "videos": [
      {
        "url": "https://www.youtube.com/watch?v=zIM4Q-Mhi00",
        "type": "youtube",
        "title": "Amazing Experiments with Science Bob Pflugfelder & Harrison Ford ...",
        "description": "Science Bob teaches Harrison Ford & Jimmy about chemical change reactions, gravity & centripetal force and they have a battle for the ages."
      },
      {
        "url": "https://www.youtube.com/watch?v=8iYhplmb1bQ",
        "type": "youtube",
        "title": "Things Will Fly: Inspiring Science Through Chaos | “Science Bob ...",
        "description": "Chaos in the classroom would normally describe a teacher's worst day. Yet for Bob Pflugfelder, chaos has a unique side effect that makes it a ..."
      },
      {
        "url": "https://www.youtube.com/watch?v=6SNzDAPtvC0",
        "type": "youtube",
        "title": "Amazing Experiments with Science Bob Pflugfelder",
        "description": "Science Bob shares demonstrations that delight and amaze – including the most exciting way to make chocolate milk ever and exploding fiery balloons!"
      }
    ]
  },
  {
    "_id": "687691c526a2e74b39bf52ab",
    "speaker_id": "405011",
    "biography": "2 Chainz, the multi-platinum, Grammy Award®-winning MC first made his mark when he broke out of his native Atlanta as a founding member of the duo Playaz Circle. Their rap-R&B-pop crossover hit “Duffle Bag Boy” featuring Lil’ Wayne, released on the DTP (Disturbing Tha Peace)/Def Jam label, sent shock waves across the hip-hop universe in 2007. Chainz’ solo career began that same year with the release of his first mixtape.\nProving that he could write street anthems with crossover appeal, Chainz capitalized on his notoriety with the back-to-back mixtapes \"Codeine Withdrawal\" (2010), and \"Codeine Cowboy\" (2011). His 2011 mixtape \"T.R.U. REALigion\" mined downloads in the millions. The outspoken rapper had established a new sphere of influence.\n2 Chainz’ name was on everyone’s lips in 2012, when he stole a verse on “Mercy,” fellow Def Jam artist Kanye West’s RIAA triple-platinum #1 R&B/#1 Rap hit (from \"Cruel Summer\"). In August 2012, Chainz arrived as a Def Jam solo artist with \"Based On A T.R.U. Story,\" his Platinum debut album, which entered the charts at #1. Its success was fueled by the platinum #1 “No Lie” featuring Drake, the double-platinum “Birthday Song” featuring Kanye West, and double-platinum “I’m Different.” “Mercy” was subsequently a Grammy® nominee for Best Rap Song and Best Rap Performance, while \"B.O.A.T.S.\" was nominated for Best Rap Album. Chainz’ dominance was extended when the sequel, \"B.O.A.T.S. II: Me Time\" entered the hip-hop chart at #1 in September 2013, and spun off the gold single, “Feds Watching” featuring Pharrell.\nIn 2016, Chainz brought it back to his essence with a series of mixtapes that dominated the streets: \"Felt Like Cappin,\" \"Daniel Son,\" \"Necklace Don,\" and \"Hibachi For Lunch.\" Also in 2016, he released the lauded collaborative album \"ColleGrove\" with New Orleans hip-hop luminary Lil Wayne. The year was capped off with his first Grammy Award, Best Rap Performance for his verse on Chance The Rapper’s hit song “No Problem.”\nWith momentum on his side in 2017, Chainz released his first solo album in four years, the RIAA platinum #1 \"Pretty Girls Like Trap Music.\" The album netted over 2 billion stream, three consecutive multi-platinum hits and accompanied by a 35-city tour of North America.\n2018 brought the EP releases \"The Play Don’t Care Who Makes It\" (February, with the RIAA gold “Proud” featuring YG and Offset, boasting over 100 million streams); and \"Hot Wings Are Girl’s Best Friend\" (November), a two-song bundle that included “Hot Wings” and “Girl’s Best Friend.” They pointed the way to the March 2019 release of Chainz’ fourth solo album, \"Rap Or Go To The League,\" described as his most personal, most lyrical, most soulful record to date. It challenged the notion that the only way out of the inner city is either to become a rapper or a ball player. The album flipped that trope, celebrating themes of black excellence, the power of education, and entrepreneurship. A&R’d by LeBron James, \"Rap Or Go\" spun off two smashes: the MTV VMA-nominated \"Rule The World\" featuring Ariana Grande (over 22 million YouTube views); and platinum “Bigger Than You” featuring Drake and Quavo (over 62 million combined YouTube views).\nChainz returned to the front line in 2020, with “Money Maker” featuring Lil Wayne, which sampled Louisiana’s HBCU Southern University world-renowned marching band, Human Jukebox. “Money Maker” was the first advance music from Chainz’ fifth solo album, \"SO HELP ME GOD\" (November 2020).\n2 Chainz’ cultural impact continues to flourish. His indie record label T.R.U. (The Real University), featuring Skooly, Cap.1, Fresh, and C White celebrated its fifth anniversary in 2020. In addition to music, his wildly popular tv show \"Most Expensivest\" on VICELAND wrapped up its third season in 2019. His “Chain Reaction” sneaker collaboration with Versace hit stores in the spring 2018, and was their most popular shoe of the year. His cannabis brand, GAS Cannabis Co. is available throughout California. His Crate Talk interview series (on his YouTube channel, part of YouTube Music’s short-form video mini-series project), which premiered in March 2019, invited guests to discuss the power of education and entrepreneurship over a game of SELF (instead of HORSE) on a basketball court in Atlanta. Also in 2019, he starred with Adam Scott in the Super Bowl LIII Expensify tv spot, “the world’s first Super Bowl commercial you can expense.”",
    "categories": [
      "Business",
      "Celebrity",
      "College",
      "Entertainment",
      "Entrepreneurship",
      "Music"
    ],
    "fee_range": {
      "live_event": "$100,000 - $200,000",
      "virtual_event": "$100,000 - $200,000"
    },
    "job_title": "Grammy Award-Winning Rapper, Songwriter & Entrepreneur; Founder of The Real University Record Label & Minority Owner in College Park Shyhawks",
    "location": "Atlanta, GA, USA",
    "name": "2 Chainz",
    "rating": {
      "average_rating": 4,
      "review_count": 1
    },
    "scraped_at": "2025-07-16T15:34:35.952000",
    "url": "https://www.allamericanspeakers.com/speakers/405011/2-Chainz",
    "videos": [
      {
        "url": "https://www.youtube.com/watch?v=OoEOHSaO2Uc",
        "type": "youtube",
        "title": "2 Chainz - Money In The Way (Official Music Video)",
        "description": ""
      },
      {
        "url": "https://www.youtube.com/watch?v=Lri_dfoOqAE",
        "type": "youtube",
        "title": "2 Chainz Checks Out $260K Speakers | Most Expensivest Shit | GQ ...",
        "description": "It costs upwards of $250,000, but it looks like Versace glasses and comes in 2 Chainz's favorite colors: black and gold. The rapper tests out the MBL..."
      },
      {
        "url": "https://www.youtube.com/watch?v=X24jYTUnqxA",
        "type": "youtube",
        "title": "2 Chainz - Blue Cheese ft. Migos - YouTube",
        "description": "Watch the official video for 2 Chainz \"\"Blue Cheese\"\" feat. Migos from Pretty Girls Like Trap Music available now http://smarturl.it/PGLTM Stream..."
      }
    ]
  },
  {
    "_id": "687691c826a2e74b39bf52af",
    "speaker_id": "399474",
    "biography": "Shayaa Bin Abraham-Joseph, also known by his stage name 21 Savage, is a British-American rapper and activist, recognized for his contributions to the rap genre. His journey into music began in 2013, following the death of a friend, which saw him rapidly gain attention in the Atlanta underground. His popularity soared following the release of the Metro Boomin-produced Savage Mode and his collaboration with Drake on the hit single \"Sneakin'.\"\nIn 2017, 21 Savage released his debut studio album, \"Issa Album,\" which debuted at number two on the Billboard 200 and featured the top twenty song \"Bank Account.\" His collaborative endeavors continued, notably marked by his feature on Post Malone's \"Rockstar,\" which became his first #1 single. The year 2018 saw the release of his second studio album, \"I Am > I Was.\" Featuring several high-profile artists, including Travis Scott, Childish Gambino, and Post Malone, the album debuted at #1 on the Billboard 200, marking his first #1 album.\n21 Savage made a significant contribution to the world of music in 2020 with the sequel to \"Savage Mode,\" \"Savage Mode II,\" in collaboration with Metro Boomin. The album peaked at number one on the Billboard 200 and included two top-ten singles. In 2022, he made a guest appearance on Drake's single \"Jimmy Cooks,\" which debuted at number one on the Hot 100, and released a collaborative studio album with Drake titled \"Her Loss.\" His third album, \"American Dream,\" released in 2024, became his fourth consecutive chart-topping project.\nWell-known for his philanthropic efforts, 21 Savage has been a strong advocate for financial literacy among children and has made significant contributions to his hometown of Atlanta. He launched the 21 Savage Bank Account Campaign in 2018, a program aimed at teaching financial management skills to children. He also hosts the annual \"Issa Back to School Drive\" in his home neighborhood in Atlanta, which provides free haircuts, hairstyles, supplies, and school uniforms. Additionally, he has donated to anti-bullying campaigns at local schools.\nOver the years, 21 Savage has received numerous accolades for his contributions to the music industry. In 2020, his single \"A Lot,\" featuring J.Cole, won Best Rap Song at the Grammy Awards. His work on the collaborative album \"Her Loss\" with Drake saw them both receive awards at the 2023 BET Hip Hop Awards. In the same year, he was nominated for various awards at the Billboard Music Awards, and his collaboration with Burna Boy on the remix of \"Sittin' on Top of the World\" garnered a Grammy nomination.",
    "categories": [
      "Celebrity",
      "Civil Rights",
      "College",
      "Entertainment",
      "Music",
      "Social Activism",
      "Social Justice"
    ],
    "fee_range": null,
    "job_title": "Grammy Award-Winning Rapper & Hip-Hop Recording Artist",
    "location": "Atlanta, GA, USA",
    "name": "21 Savage",
    "scraped_at": "2025-07-16T15:34:38.256000",
    "url": "https://www.allamericanspeakers.com/speakers/399474/21-Savage",
    "videos": [
      {
        "url": "https://www.youtube.com/watch?v=7jvqA8jkVbc",
        "type": "youtube",
        "title": "21 Savage Speaks To \"Good Morning America\" About Immigration ...",
        "description": ""
      },
      {
        "url": "https://www.youtube.com/watch?v=2ub0aCEOYnk",
        "type": "youtube",
        "title": "21 Savage On Evolving Through Loyalty, Loss, Fatherhood + New ...",
        "description": ""
      },
      {
        "url": "https://www.youtube.com/watch?v=sV2t3tW_JTQ",
        "type": "youtube",
        "title": "21 Savage - Bank Account (Official Audio)",
        "description": ""
      }
    ]
  },
  {
    "_id": "687691ca26a2e74b39bf52b2",
    "speaker_id": "403971",
    "biography": "After more than four decades together, 38 Special continues to bring a signature blast of Southern Rock to over 100 cities a year. At each and every show, thousands of audience members are amazed by the explosive power of the band's performance. Their many Gold and Platinum album awards stand in testament to the endurance of a legendary powerhouse.\nWith sales in excess of 20 million and over 1.8 million monthly listeners on Spotify, most associate the band with their arena-rock pop smashes, “Hold On Loosely,” “Rockin’ Into the Night,” “Caught Up in You,” “Fantasy Girl,” “If I’d Been the One,” “Back Where You Belong,” “Chain Lightnin’,” “Second Chance,” and more – Timeless hits that remain a staple at radio, immediately recognizable from the first opening chord, and paving the way to their present-day touring regimen.\nSince 1976, the band has released more than 15 albums. And from the start, they’ve toured relentlessly, bringing their signature brand of ‘muscle and melody’ to fans worldwide. It is that steely determination that lives on in the hearts of these ‘Wild-Eyed Southern Boys.'\nFor 38 Special, being onstage is a celebration of camaraderie and brotherhood, a precision unit bringing the dedication and honesty to a long history of classic songs, as well as surprisingly fresh new material. The current lineup includes Guitarist and vocalist Don Barnes, keyboardist and vocalist Bobby Capps, drummer Gary Moffatt, bassist Barry Dunaway, and guitarist Jerry Riggs.",
    "categories": [
      "Celebrity",
      "Music"
    ],
    "fee_range": {
      "live_event": "$100,000 - $200,000"
    },
    "job_title": "Southern Rock Band Known for  \"Hold On Loosely\" & \"Second Chance\"",
    "location": "an undisclosed location",
    "name": "38 Special",
    "scraped_at": "2025-07-16T15:34:40.587000",
    "url": "https://www.allamericanspeakers.com/speakers/403971/38-Special"
  },
  {
    "_id": "687691cc26a2e74b39bf52bc",
    "speaker_id": "385009",
    "biography": "3OH!3, an electronic music duo from Boulder, Colorado, composed of Sean Foreman and Nathaniel Motte, has been making waves in the music industry since 2004. Best known for their hit single \"DONTTRUSTME\" from their album \"Want,\" which reached number seven on the Billboard Hot 100, they have consistently produced chart-topping music. Their remix of \"Starstrukk\" featuring Katy Perry and their collaboration with Kesha on \"My First Kiss\" further cemented their place in the industry. Their albums, the most noteworthy being \"Want\" and \"Streets of Gold,\" have even peaked on the Billboard 200 chart.\nIn addition to their musical accomplishments, 3OH!3 has been active in live performances and television appearances. They have toured with notable bands like All Time Low, Boys Like Girls, and Third Eye Blind and have also been featured in TV shows, including a performance at the MTV Video Music Awards in 2009. Their presence in the live music scene did not wane over the years as they performed on \"American Idol\" with Kesha in 2016, took part in Emo Nite LA in 2018, and participated in the final run of the Vans Warped Tour in 2018.\n3OH!3's discography, including \"3OH!3,\" \"Want,\" \"Streets of Gold,\" \"Omens,\" \"Night Sports,\" and their latest release, \"Need,\" in 2021, demonstrates their continued relevance and growth in the music industry. Their collaboration with Blues Traveler and their varied music genre, a mix of electropop, synth-pop, pop rap, trap, alternative rock, and electronic rock, have allowed them to reach a wide range of audiences. Their consistent musical output, coupled with their engaging live performances, has kept them in the limelight. Their efforts were recognized when they were named as one of the Best of Denver® in 2016.",
    "categories": [
      "Celebrity",
      "Entertainment",
      "Music"
    ],
    "fee_range": {
      "live_event": "$50,000 - $100,000"
    },
    "job_title": "American Electropop Duo; \"Don't Trust Me\"",
    "location": "Boulder, CO, USA",
    "name": "3OH!3",
    "scraped_at": "2025-07-16T15:34:42.877000",
    "url": "https://www.allamericanspeakers.com/speakers/385009/3OH%213",
    "videos": [
      {
        "url": "https://www.youtube.com/watch?v=pUJLow6hI_U",
        "type": "youtube",
        "title": "2016 Monster Energy Pit Blog: 3OH!3 Interview",
        "description": ""
      },
      {
        "url": "https://www.youtube.com/watch?v=fY3SK1_yT88",
        "type": "youtube",
        "title": "3OH!3: HEAR ME NOW [OFFICIAL VIDEO] - YouTube",
        "description": ""
      },
      {
        "url": "https://www.youtube.com/watch?v=mdB3Oyd5HtU",
        "type": "youtube",
        "title": "3OH!3 - DON'T TRUST ME [OFFICIAL MUSIC VIDEO] - YouTube",
        "description": ""
      }
    ]
  }
]