[
  {
    "_id": "687640b926a2e74b39beba8d",
    "speaker_page_url": "https://www.leadingauthorities.com/speakers/sarah-robb-ohagan",
    "books_and_publications": [
      {
        "title": "Extreme You: Step Up. Stand Out. Kick Ass. Repeat.",
        "url": "https://www.amazon.com/Extreme-You-Step-Stand-Repeat/dp/0062456156",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/images/dududvs0.original.jpg"
      },
      {
        "title": "Extreme You Book Cover",
        "url": "https://www.sarahrobbohagan.com/book",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/styles/260x350/public/2025-01/O%27Hagan-Robb-Sarah-Extreme-You2.jpg"
      }
    ],
    "client_testimonials": [
      {
        "quote": "She was fantastic and had the perfect tone and spirit for our team.  What she shared about humanity was \"spot on\" and everyone loved the challenge she threw out to the group around asking 10 people we know for 5 words that describe us.  I can't wait for the results!! She is an absolute gem and I'm honored to have met her and spent a short amount of time with her.",
        "author": "Yahoo"
      },
      {
        "quote": "Sarah is definitely a rockstar. She was so easy to work with onsite, very flexible and easy going (which is always greatly appreciated) and just genuinely a very nice person. She was really generous with her time with the members and they all adored her.",
        "author": "American Bakers Association"
      },
      {
        "quote": "Sarah Robb O'Hagan is a powerhouse! Her strong on-stage presence and engaging delivery grabbed the audience immediately. Her amazing message, told with humor, passion and honesty, kept their focus throughout. We were thrilled to have her join us!",
        "author": "Twitter"
      },
      {
        "quote": "She lit up the room like the 4th of July. The audience was just so receptive and complimentary of her performance it was almost scary. The rest is history like they say. To ask if we were happy with the talk is actually modest; I’d describe it more as ecstatic.",
        "author": "American Apparel"
      },
      {
        "quote": "What a superstar! Her ability to share high-profile business results to the group was brilliant. She’s a very impressive human being. She was very friendly and approachable. We were especially impressed with how she interacted with our attendees both before and after the presentation including personally responding to social media mentions.",
        "author": "Property Solutions"
      },
      {
        "quote": "She was phenomenal!! Rave reviews from everyone - President to the new CEO to all the attendees. She reached out and got our brand guidelines before the event and incorporated all kinds of things about our new brand and vision. Smashing success!!",
        "author": "Willow Bridge Property CO"
      }
    ],
    "description": "Described by the media as everything from “Superwoman undercover” to “The Pied Piper of potential,” Sarah Robb O’Hagan is an executive, entrepreneur, author, and founder of Extreme Living — a content platform designed to help individuals, teams, and organizations play to their highest potential. She is a leading global thought leader in the conversation around the future of work, having pioneered a new blueprint for workplace culture during her tenure as the CEO of EXOS, the human performance coaching company. This approach which she rolled out to Fortune 100 clients proved to not only increase productivity and performance but significantly reduce employee disengagement and burnout.\n\nSarah is a rare blend of fierce businesswoman, cheerleading Mom, passionate women’s advocate, and high-energy innovator. In fast-paced presentations and in her book, Extreme You: Step Up, Stand Out, Kick Ass, Repeat, Sarah lays out a roadmap for becoming the most “extreme” version of yourself by playing to your own unique passions and strengths, and by building highly-collaborative, focused, and successful teams and corporations. Drawing on her decades of experience at some of the world’s most influential brands, she shares practical takeaways including how to get comfortable making bold moves and using failures in work or life to come back stronger, how to discover your most competitive playing field, and most importantly, how to tune your own mind and body for best performance in a fast-paced, hybrid work world so you can also empower the kind of teamwork that brings out the best in everyone else. She is exclusively represented by Leading Authorities speakers bureau.\n\nProfessionally, Sarah is widely regarded as a transformational leader having personally led groundbreaking innovations in her corporate career. Her achievements include reimagining Gatorade as a cutting-edge sports performance brand, orchestrating the iconic Virgin Atlantic Airways partnership with the Austin Powers movie, transitioning Equinox into a dynamic, always-on, digital-first fitness business, and navigating the successful transformation of her most recent company, EXOS, during the pandemic.\n\nShe is also not afraid to talk about what she calls her “canyon of career despair” in her 20s, using major back-to-back failures to learn, grow, and motivate herself forward to eventually lead a $5 billion global business by the age of 38. Sarah shares firsthand accounts of these peaks and valleys — pairing stories of firings with a behind-the-scenes look at Gatorade’s transformational turnaround under her stewardship — to illustrate what it truly takes to be successful. She teaches us why you learn more when you play for all or nothing, the importance of humility, and why you must always “play your own game.” She also taps into her own experiences with extreme burnout after giving birth to her third child in the midst of the Gatorade turnaround. Sarah discusses how it informed the work she did at EXOS, helping corporate clients and executives around the world to lead healthy, high performing teams.\n\nSarah Robb O’Hagan has been named twice to Forbes magazine’s list of the “Most Powerful Women in Sports,” named a “Woman to Watch” by Ad Age magazine, dubbed one of the “Most Creative People in Business” by Fast Company, and named to “40 Under 40” lists by Sports Business Journal, Crain’s Chicago Business, and Sports Goods Business. She also complements her operating experience with board service, having served on the board of Strava, as well as her current role as an independent director for JetBlue Airways.\n\nSarah is a passionate advocate for an active lifestyle and believes the lessons learned from sports and fitness can be applied to improve performance in the workplace. She has served on Hillary Clinton’s U.S. State Department Council to Empower Women and Girls through Sports and is a trustee of the Women’s Sports Foundation. She is an active member of the World Class New Zealand Network, as she remains committed to helping the country’s development, international competitiveness, and economic growth. In 2016, she was awarded the Sir Peter Blake Trust Award for outstanding leadership, and in 2018 she was named a “WISE” Woman of the Year.",
    "download_profile_link": "https://www.leadingauthorities.com/print/view/pdf/speaker/bio?view_args[]=17887",
    "download_topics_link": "https://www.leadingauthorities.com/print/view/pdf/speaker/topic?view_args[]=17887",
    "job_title": "Game Changing Business Leader, Former CEO of EXOS the Performance Coaching Company, Former President of Equinox, Former Global President of Gatorade, Former Marketing Director at Nike and the Virgin Group",
    "name": "Sarah Robb O'Hagan",
    "recent_news": [
      {
        "title": "Exos CEO Sarah Robb O'Hagan Believes a Four-Day Workweek Will Soon Be the Norm",
        "url": "https://www.fastcompany.com/91133780/exos-ceo-sarah-robb-ohagan-four-day-workweek?utm_medium=Notification&utm_source=Pushly&utm_content=MANUAL&utm_campaign=4802881&cid=pushly"
      },
      {
        "title": "To combat employee burnout, this CEO created 'You Do you Fridays'",
        "url": "https://www.cnn.com/2024/05/08/business/video/before-the-bell-4-day-work-week-exos-ceo-digvid"
      },
      {
        "title": "Five Minutes With: Sarah Robb O'Hagan, CEO at Exos",
        "url": "https://businesschief.com/leadership-and-strategy/five-minutes-with-sarah-robb-ohagan-exos"
      },
      {
        "title": "This coaching business wants to help bring the 4-day workweek to ‘hundreds of thousands’ more people",
        "url": "https://www.cnbc.com/2023/03/29/exos-coaching-4-day-workweek-could-be-coming-to-fortune-100-companies.html"
      },
      {
        "title": "How one company focuses on ‘recovery’ to combat employee disengagement",
        "url": "https://www.worklife.news/culture/culture-code"
      },
      {
        "title": "‘Getting fired was one of the best lessons I ever learnt’",
        "url": "https://keanewzealand.com/getting-fired-was-one-of-the-best-lessons-i-ever-learnt/"
      },
      {
        "title": "How one company focuses on ‘recovery’ to combat employee disengagement",
        "url": "https://www.worklife.news/culture/culture-code/?utm_campaign=Worklife%20Briefing%2003302023&utm_source=wldis&utm_medium=email&utm_content=Worklife%20Briefing%2003302023%20CID_7f240b6cba2972263dcd615e8e2e7bfe&utm_term=How%20one%20company%20focuses%20on%20recovery%20to%20combat%20employee%20disengagement"
      },
      {
        "title": "Three Tips to Energize a Burned Out Team",
        "url": "https://www.linkedin.com/pulse/three-tips-energize-burned-out-team-sarah-robb-o-hagan/"
      },
      {
        "title": "Equipping employees to do less can improve results",
        "url": "https://qz.com/how-rest-and-recovery-can-prevent-stress-and-aid-perfor-1849929793"
      },
      {
        "title": "Mental Health Champions: Why & How Sarah Robb O’Hagan Of Exos Is Helping To Champion Mental Wellness",
        "url": "https://medium.com/authority-magazine/mental-health-champions-why-how-sarah-robb-ohagan-of-exos-is-helping-to-champion-mental-5d88b8362ca2"
      },
      {
        "title": "Popular Female Speakers for Your Event",
        "url": "https://www.leadingauthorities.com/blog/popular-female-speakers-your-event"
      },
      {
        "title": "20 Keynote Speakers For Your Leadership Meetings",
        "url": "https://www.leadingauthorities.com/blog/speakers-your-leadership-meetings"
      },
      {
        "title": "Podcast: The Art of Charm Ep. 609 - Sarah Robb O’Hagan | Extreme You",
        "url": "https://theartofcharm.com/podcast-episodes/sarah-robb-ohagan-extreme-you-episode-609/"
      },
      {
        "title": "Thinking Like a Fortune 100 Leader",
        "url": "https://www.leadingauthorities.com/blog/thinking-fortune-100-leader"
      },
      {
        "title": "Experts on Today’s Top Topics in Leadership",
        "url": "https://www.leadingauthorities.com/blog/experts-todays-top-topics-leadership"
      },
      {
        "title": "Speakers on the Top 10 Business Trends of 2023",
        "url": "https://www.leadingauthorities.com/blog/speakers-top-10-business-trends"
      },
      {
        "title": "Fmr Nike, Gatorade Exec on Disrupting Your Own Business",
        "url": "https://www.leadingauthorities.com/blog/fmr-nike-gatorade-exec-disrupting-your-own-business"
      },
      {
        "title": "Rockstar Speaker Sarah Robb O'Hagan",
        "url": "https://www.leadingauthorities.com/blog/rockstar-speaker-sarah-robb-ohagan"
      },
      {
        "title": "Sarah Robb O'Hagan: 3 Tips For Pushing Past Failure",
        "url": "https://www.leadingauthorities.com/blog/sarah-robb-ohagan-3-tips-pushing-past-failure"
      },
      {
        "title": "Top Marketing Speaker Shares Personal Experiences on Failure and Changing the Game",
        "url": "https://www.leadingauthorities.com/blog/top-marketing-speaker-shares-personal-experiences-failure-and-changing-game-1"
      },
      {
        "title": "People feel significantly better with a 4-day workweek, says Exos CEO Sarah Robb O’Hagan",
        "url": "https://www.cnbc.com/video/2024/04/02/people-feel-significantly-better-with-a-4-day-workweek-says-exos-ceo-sarah-robb-ohagan.html"
      },
      {
        "title": "An Increasingly Popular Perk is Hitting Hurdles as Employers Overlook the Pitfalls",
        "url": "https://www.bizjournals.com/sanfrancisco/bizwomen/news/latest-news/2024/04/four-day-workweek-benefit-job-market-hiring.html?page=3"
      }
    ],
    "social_media": {
      "twitter": "https://twitter.com/extremeSRO"
    },
    "speaker_fees": {},
    "speaker_image_url": "https://www.leadingauthorities.com/sites/default/files/styles/530x350/public/2025-01/SRO_photo.png",
    "speaker_website": "https://extremeyou.com/sarah-robb-ohagan/",
    "topics": [
      {
        "title": "From Burnout to High Performance: How to Build a Kick-Ass Hybrid Work Culture.",
        "description": "When Sarah Robb O’Hagan began leading the turnaround of the $5 billion global Gatorade business amid a global recession, she was also preparing to give birth to her third child. Largely skipping her maternity leave, the combination of extreme hours and late-night childcare led her to experience an extreme and painful “burnout” that changed her perspective and her approach to work life forever.\nYears later — taking on the role of CEO at EXOS, the human performance company, at the start of the global pandemic — she decided that a successful business turnaround while burning people out was not an option. As a result, she partnered with the performance science experts on her team, as well as some of the best organizational psychologists in the world to design and implement a far more sustainable and enjoyable way of getting business results while working under immense pressure.\nIn this talk, Sarah outlines:"
      },
      {
        "title": "Epic Teaming: How to Build High-Performance, High-Fun Team Cultures.",
        "description": "Sarah Robb O’Hagan has a strong track-record of implementing game-changing innovation and growth strategies, which is why she knows that the only way to bring out the best in ourselves is to bring out the best in others. With her decades-long career, predominantly in the sports and human performance industry, she has seen up close what epic teamwork looks like and how the common characteristics of great teams translate seamlessly from the world of sports to business.\nWith this talk, she explains:\nWith anecdotes from her days working for highly team-oriented corporate cultures (including Nike and Virgin), as well as insight into the strategies she used while transforming major global companies, she describes what it means to build and contribute to an “extreme team,” how to work through intergenerational workforce dynamics, and how to get proximate with those least like yourself to truly understand the unique gifts that individuals can contribute to your team."
      },
      {
        "title": "Leading Through Turbulence: How to Turn Headwinds to Tailwinds.",
        "description": "Sarah Robb O’Hagan is no stranger to huge business headwinds. Stepping into her role as CEO of EXOS in early February 2020, she found herself not in the “dream job” she thought she had just accepted, but in the fight of her life leading a business that consisted of hundreds of brick-and-mortar gym sites around the world, which would be severely impaired by the global pandemic. Despite the complexities surrounding them, she and her team kept the business afloat and evolved it into a far stronger company as they shifted their focused to tackling the next phase of its growth. Earlier in her career, she had successfully led the turnaround of the $5 billion Gatorade business in the midst of a global recession after inheriting what the media called a “flaming mess,” so she knew the playbook and how it needed to be adapted to succeed in the big, long climb ahead of her.\nThese successful turnarounds, as well as her decades in the human performance industry have taught her innumerable lessons about succeeding in life and business, the most important being this: There is no way to get through life without experiencing adversity; Knowing how to harness the lessons to bounce back stronger is a skill everyone should have.\nWith this speech, Sarah outlines:\nContinue Reading »"
      }
    ],
    "topics_and_types": [
      {
        "name": "Peak Performance",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:42"
      },
      {
        "name": "Inspiration & Motivation",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:2"
      },
      {
        "name": "Leadership",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:4"
      },
      {
        "name": "Marketing",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:40"
      },
      {
        "name": "Retail",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:46"
      },
      {
        "name": "Risk-Takers",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:53"
      },
      {
        "name": "Teamwork & Collaboration",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:50"
      },
      {
        "name": "Turnaround",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:14"
      },
      {
        "name": "Branding",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:35"
      },
      {
        "name": "Change Management",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:13"
      },
      {
        "name": "Corporate Culture",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:7"
      },
      {
        "name": "Creativity",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:20"
      },
      {
        "name": "Crisis Management",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:21"
      },
      {
        "name": "Disruption & Digital Transformation",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:12"
      },
      {
        "name": "Entrepreneurship",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:33"
      },
      {
        "name": "Growth",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:36"
      },
      {
        "name": "Mental Health, Happiness, & Wellness",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:47"
      },
      {
        "name": "Athletes, Coaches, & Commentators",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:58"
      },
      {
        "name": "Authors",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:56"
      },
      {
        "name": "Business Leaders From Major Brands",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:60"
      },
      {
        "name": "CEOs",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:61"
      },
      {
        "name": "College & University Speakers",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:74"
      },
      {
        "name": "Female Business Leaders",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:67"
      },
      {
        "name": "Female Speakers",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:70"
      }
    ],
    "videos": [
      {
        "title": "Sarah Robb O'Hagan: To Keep Up, You Have to Go Extreme",
        "video_id": "juBMnRd8NX6cuLnBReNvHb",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/sarah-robb-ohagan-keep-you-have-go-extreme",
        "thumbnail_url": "https://play.vidyard.com/juBMnRd8NX6cuLnBReNvHb.jpg"
      },
      {
        "title": "Sarah Robb O'Hagan on Peak Performance",
        "video_id": "XYJDuDWbFQJRt95oNeW9YM",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/sarah-robb-ohagan-peak-performance",
        "thumbnail_url": "https://play.vidyard.com/XYJDuDWbFQJRt95oNeW9YM.jpg"
      },
      {
        "title": "Sarah Robb O'Hagan Discusses the 4-Day Workweek",
        "video_id": "4vIguKknfaE",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/sarah-robb-ohagan-discusses-4-day-workweek",
        "thumbnail_url": "https://img.youtube.com/vi/4vIguKknfaE/0.jpg"
      },
      {
        "title": "Sarah Robb O'Hagan: Tapping Into Your Potential",
        "video_id": "m8NulDqcWqo",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/sarah-robb-ohagan-tapping-your-potential",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/m8nuldqcwqo.original.jpg"
      },
      {
        "title": "Sarah Robb O'Hagan's Interview With Gayle King",
        "video_id": "9_LPsDU3OqE",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/sarah-robb-ohagans-interview-gayle-king",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/9_lpsdu3oqe.original.jpg"
      },
      {
        "title": "Extreme You. Step Up. Stand Out. Kick Ass. Repeat.",
        "video_id": "-s7j2s6bJaQ",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/extreme-you-step-stand-out-kick-ass-repeat",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/-s7j2s6bjaq.original.jpg"
      }
    ]
  },
  {
    "_id": "687640c926a2e74b39bebaac",
    "speaker_page_url": "https://www.leadingauthorities.com",
    "books_and_publications": [],
    "client_testimonials": [],
    "description": "N/A",
    "job_title": "N/A",
    "name": "N/A",
    "recent_news": [],
    "speaker_fees": {},
    "topics": [],
    "topics_and_types": [],
    "videos": []
  },
  {
    "_id": "687640d826a2e74b39bebac4",
    "speaker_page_url": "https://www.leadingauthorities.com/speakers/nicolle-wallace",
    "books_and_publications": [
      {
        "title": "Madam President: A Novel",
        "url": "https://www.amazon.com/dp/1476756899",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/images/wallace-nicolle-bk-madam-president.original.jpg"
      },
      {
        "title": "Eighteen Acres",
        "url": "https://www.amazon.com/dp/1439195935",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/images/wallace-nicolle-bk-eighteenacres-70-105.original.jpg"
      },
      {
        "title": "It's Classified",
        "url": "https://www.amazon.com/dp/1451610971",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/images/wallace-nicolle-bk-itsclassified-70-105.original.jpg"
      },
      {
        "title": "Nicole Wallace's Podcast Deadline: White House",
        "url": "https://podcasts.apple.com/us/podcast/deadline-white-house/id1367201919",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/styles/260x350/public/2021-06/wallace-nicole-podcast-deadline-white-house.png"
      }
    ],
    "client_testimonials": [],
    "description": "Nicolle Wallace is a New York Times best-selling author, political analyst, top strategist for the GOP, and the former special assistant to the President and director of communications at the White House under President George W. Bush. She is currently the host of MSNBC's Deadline: White House, a frequent contributor and guest host on The 11th Hour with Brian Williams, and Morning Joe, and a contributor on The Today Show. The New York Times called her a “tough, savvy, and hard-charging conservative political operator,” and her White House colleague, presidential political advisor, Mark McKinnon, called her a “rare talent in politics.” Funny and charming, she shares fascinating stories from her time in the White House, on the campaign trail with Sarah Palin, and from the studios at MSNBC and ABC, where she was a co-host on ABC's The View. She is someone that audiences will not only recognize from TV but love on stage. Exclusively represented by Leading Authorities speakers bureau, Wallace is a master storyteller as she looks at the latest in politics and the media and offers audiences the rundown on today’s biggest players and issues.\n\nFrom Inside The White House. Wallace served as the communications chief for George W. Bush’s White House and re-election campaign and was credited with “injecting a tremendous amount of realism” into White House deliberations.  According to the Washington Post, she served as “a voice for more openness with reporters.” The New York Times story announcing her presidential appointment carried the headline: “New Aide Aims to Defrost the Press Room,” and she was described by former colleagues as “very persuasive in the halls of the West Wing.”\n\nWallace also served as senior campaign advisor for the McCain-Palin Presidential campaign in 2008. She appeared frequently on network and cable news programs as the campaign’s top spokesman and defender. In the 2012 HBO film, Game Change, she was portrayed by Sarah Paulson.\n\nBefore her time in the White House, she was a press secretary for Governor Jeb Bush (R-FL). She is also a former political analyst for CBS Evening News.\n\nBest-Selling Political Author. Wallace is the author of several New York Times best-selling contemporary political novels, which include, Madam President, Eighteen Acres, It’s Classified, and Day in the Life. The books feature women in top political roles, including President, Secretary of Defense, Chief of Staff, and White House Correspondent.\n\nShe is a California native and graduate of the University of California, Berkeley, and Northwestern University’s Medill School of Journalism.",
    "download_profile_link": "https://www.leadingauthorities.com/print/view/pdf/speaker/bio?view_args[]=17554",
    "download_topics_link": "https://www.leadingauthorities.com/print/view/pdf/speaker/topic?view_args[]=17554",
    "job_title": "Political Analyst, New York Times Best-Selling Author, and Former White House Director of Communications",
    "name": "Nicolle Wallace",
    "recent_news": [
      {
        "title": "Nicolle Wallace’s Road From the White House to 30 Rock",
        "url": "https://www.nytimes.com/2018/01/20/business/nicolle-wallaces-road-from-the-white-house-to-30-rock.html"
      },
      {
        "title": "A Drive-Through Window Revelation and Pitching the CEO at a Buffet: How MSNBC’s Nicolle Wallace Cooked Up NBC’s Ukraine Fundraiser",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/a-drive-through-window-revelation-and-pitching-the-ceo-at-a-buffet-how-msnbcs-nicole-wallace-cooked-up-nbcs-ukraine-fundraiser-1235174611/"
      },
      {
        "title": "Nicolle Wallace Gets Ready to Launch ‘Deadline: White House’ on MSNBC",
        "url": "https://variety.com/2017/tv/news/nicolle-wallace-msnbc-deadline-white-house-1202418660/"
      },
      {
        "title": "Sarah Palin, Rage Whisperer",
        "url": "https://www.nytimes.com/2016/01/26/opinion/sarah-palin-rage-whisperer.html?_r=1"
      },
      {
        "title": "A Drive-Through Window Revelation and Pitching the CEO at a Buffet: How MSNBC’s Nicolle Wallace Cooked Up NBC’s Ukraine Fundraiser",
        "url": "https://www.hollywoodreporter.com/tv/tv-news/a-drive-through-window-revelation-and-pitching-the-ceo-at-a-buffet-how-msnbcs-nicole-wallace-cooked-up-nbcs-ukraine-fundraiser-1235174611/?elqTrackId=EBA61AA02786B9572A44AB2302BD9323&elqTrack=true"
      },
      {
        "title": "Nicolle Wallace: ‘Nikki Haley turned her back on her own voters’",
        "url": "https://www.youtube.com/watch?v=SXB7dvGC504"
      },
      {
        "title": "Desperate Donald Trump and his GOP allies urge Supreme Court to act after guilty verdict",
        "url": "https://www.youtube.com/watch?v=ufslmy2MD4k"
      }
    ],
    "social_media": {
      "twitter": "https://twitter.com/NicolleDWallace"
    },
    "speaker_fees": {},
    "speaker_image_url": "https://www.leadingauthorities.com/sites/default/files/styles/530x350/public/images/wallace-nicolle-speaker.original.jpg",
    "speaker_website": "http://www.nicollewallace.com/",
    "topics": [
      {
        "title": "Political Outlook & News Of The Day.",
        "description": "Nicolle Wallace shares her inside perspective of the political news of the day and offers her candid and insightful thoughts on what’s next for GOP and Democratic parties and leadership. Passionate, funny, and charming, she breaks down what’s going on behind-the-scenes in the White House and on Capitol Hill, the impact of partisanship on politics in DC and nationwide, and how technology and social media are changing the political landscape. Through fascinating stories from her time in the White House, on the campaign trail with Sarah Palin, and at MSNBC and ABC studios, Wallace has her finger on the pulse of the Beltway and gives audiences the rundown they need to stay in the know."
      },
      {
        "title": "Women In Politics.",
        "description": "Nicolle Wallace saw and experienced firsthand how women are perceived in politics. From stereotypes and more aggressive scrutiny on the campaign trail to comparing the reception of female leaders like Sarah Palin and Hillary Clinton to that of their male counterparts, Nicolle looks at the unique challenges female leaders face. She also shares insights on what it will take for America to finally get its first female president—and how that will change the country for the better.\nContinue Reading »"
      }
    ],
    "topics_and_types": [
      {
        "name": "Politics",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:3"
      },
      {
        "name": "Authors",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:56"
      },
      {
        "name": "Female Speakers",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:70"
      },
      {
        "name": "Media",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:63"
      },
      {
        "name": "Moderator",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:64"
      },
      {
        "name": "Political Analysts",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:57"
      }
    ],
    "videos": []
  },
  {
    "_id": "687640ea26a2e74b39bebae8",
    "speaker_page_url": "https://www.leadingauthorities.com/speakers/stanley-mcchrystal",
    "books_and_publications": [
      {
        "title": "Risk: A User's Guide",
        "url": "https://www.amazon.com/Risk-Users-Guide-Stanley-McChrystal/dp/0593192206#:~:text=Retired%20four%2Dstar%20general%20Stan,organizations%20fail%20to%20mitigate%20risk.",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/2021-06/mcchrystal-stan-BK-risk-a-users-guide.png"
      },
      {
        "title": "Leaders: Myth and Reality",
        "url": "https://www.barnesandnoble.com/w/leaders-stanley-mcchrystal/1128233494?ean=9780525534372",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/images/mcchrystal-stan-leadersmythreality-bk.original.jpg"
      },
      {
        "title": "Team of Teams: New Rules of Engagement for a Complex World",
        "url": "https://www.amazon.com/dp/1591847486",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/images/mcchrystal-stan-bk-teamofteams.original.jpg"
      },
      {
        "title": "My Share of the Task: A Memoir",
        "url": "https://www.amazon.com/dp/1591844754",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/images/34334_mcchrystal_stan_bk_myshareofthetask.original.jpg"
      },
      {
        "title": "Cover of the book On Character: Choices That Define a Life by General Stanley McChrystal, U.S. Army, Retired. The cover design features a dark navy background with gold and white typography, giving it a classic and authoritative look. ",
        "url": "https://www.penguinrandomhouse.com/books/767689/on-character-by-general-stanley-mcchrystal/",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/styles/145x230/public/2025-03/mcchrystal-stanley-book.png"
      },
      {
        "title": "No Turning Back Podcast",
        "url": "https://podcasts.apple.com/us/podcast/no-turning-back/id1527309309",
        "image_url": "https://www.leadingauthorities.com/sites/default/files/styles/145x135/public/2020-09/no-turning-back-small-image.png"
      }
    ],
    "client_testimonials": [
      {
        "quote": "The General was exceptional and all attendees continue to rave about the event. We were so happy to have General McChrystal with us and hope he had a good time at the event as well.",
        "author": "Hoover Group, Inc"
      },
      {
        "quote": "It was wonderful. Such a great presentation to end our program with. Standing ovation from our group.",
        "author": "Ace Hardware"
      },
      {
        "quote": "General McChrystal’s talk last night was absolutely superb -- and he received not one, but two (!) standing ovations.  Mrs. McChrystal was also a true delight, and everyone was so happy to meet her as well as him.  Thank you again for all of your help.  Will look forward to working with all of you again in the future.",
        "author": "Hoover Institute at Stanford University"
      },
      {
        "quote": "Let me start by saying, the relationship that Leading Authorities and I have developed over the past few months, will last a lifetime.  As for the keynote speech by General Stanley McChrystal, there are many ways and words to describe his time with us, however here are just a few: first class, superb, impressive, fantastic, simply the best. The General’s professionalism, positivity, high energy, concept and communication of leadership principles, coupled with his commitment to Siemens, our staff and our annual Conference Industrial Academy was absolutely unmatched.  As a believer in professional and personal growth, the General provided us with great value and growth in these two areas. The investment was priceless based on General McChyrstal’s impact on our organization. Specifically, we want to thank General Stanley McChrystal and Leading Authorities for allowing us the opportunity to spend an evening with one of ‘America’s Greatest Warriors’.",
        "author": "Industrial Sales Division"
      },
      {
        "quote": "We were honored to have GEN McChrystal with us for the afternoon and the reaction to his presentation has been very positive. I truly appreciate your partnership in making the day happen! I know government processes and our security procedures are sometimes tedious but it always pays off in the end. I appreciate GEN McChrystal's and Cherylanne's patience as we worked through things during their visit and hope they enjoyed the day as much as everyone here. People are still talking about it!",
        "author": "National Security Agency"
      },
      {
        "quote": "Wow! What a perfect closing speaker for our conference. The discussion with the General was highly informative, inspiring and entertaining. And it even organically plugged into the themes of the event. There was a consistent theme of “building company culture” throughout the event the General really brought it all together. When little things like that come together, you know that the event is a success. The General was instrumental in making that happen and sent attendees on their way in the right frame of mind.",
        "author": "Analytical, Life Science & Diagnostics Association"
      }
    ],
    "description": "A one-of-a-kind commander with a new perspective on organizational dynamics, General Stan McChrystal is known for helping elite teams tap into the potential of their people to better compete in a complex and interconnected world. Few can speak about leadership, teamwork, and international affairs with as much insight as he can.\n\nOffering A Four-Star Perspective. The son and grandson of Army officers, McChrystal has a legacy of service. He graduated from West Point in 1976 and was commissioned as an infantry officer. He later trained at the Special Forces School in Fort Bragg, North Carolina and spent much of his career commanding special operations and airborne infantry units. During the Persian Gulf War, McChrystal served in a Joint Special Operations Task Force and later commanded the 75th Ranger Regiment. \n\nIn 2002, he was appointed chief of staff of military operations in Afghanistan. Two years later, McChrystal was selected to deliver the nationally televised Pentagon briefings about military operations in Iraq. From 2003–2008, he commanded JSOC and was responsible for leading the nation’s deployed military counter-terrorism efforts around the globe, assuming command of all international forces in Afghanistan in June 2009. President Obama’s order for an additional 30,000 troops to Afghanistan was based on McChrystal’s assessment of the war.\n\nRethinking how elite teams function. After retiring from the U.S. Army, General McChrystal turned his expertise to the business world. As the author of best-selling management books, General McChrystal offers a battle-tested system for detecting and responding to risk. He is also the Founder and CEO of the McChrystal Group, which helps Fortune 500 Companies strike the right balance between hierarchical and decentralized team mindsets and structures. Exclusively represented by Leading Authorities speakers bureau, McChrystal, a former Green Beret, is known for his candor, innovative leadership, and going the distance. Called “one of America’s greatest warriors” by Secretary of Defense Robert Gates, few can speak about leadership, teamwork, and international affairs/geopolitics with as much insight.\n\nFor more than ten years, the McChrystal Group has advised companies on how to thrive as the world changes. The McChrystal Group designs custom business solutions and leadership development programs to cultivate trust, empowerment, common purpose, and shared knowledge across organizations. With these skills, General McChrystal will explain how your organization can operate as a nimble “team of teams,” which is essential in today’s competitive and rapidly-changing business landscape.\n\nLeading in Uncertain Times. A dynamic, powerful speaker, McChrystal impresses audiences with field-tested leadership lessons, stressing a uniquely inclusive model that focuses on building teams capable of relentlessly pursuing results. When old systems fall short, he believes true leaders must look for ways to innovate and change. Citing stories from his career, McChrystal reminds us that in a world where things are moving at a speed we’ve never experienced, we need leaders more than ever—and he teaches us how to rise to the occasion.",
    "download_profile_link": "https://www.leadingauthorities.com/print/view/pdf/speaker/bio?view_args[]=16592",
    "download_topics_link": "https://www.leadingauthorities.com/print/view/pdf/speaker/topic?view_args[]=16592",
    "job_title": "Former Commander of U.S. and International Forces in Afghanistan, Best-Selling Author of \"Risk: A User's Guide,\" \"Team of Teams,\" and \"On Character,\" and Co-Founder of the McChrystal Group",
    "name": "Stanley McChrystal",
    "recent_news": [
      {
        "title": "Gen. Stanley McChrystal discusses leadership with President Fitts at Book Fest",
        "url": "https://news.tulane.edu/news/president-fitts-general-stanley-mcchrystal-risk-users-guide"
      },
      {
        "title": "General Stanley McChrystal: How to Lead Resilient Teams Through Uncertainty",
        "url": "https://www.inc.com/stanley-mcchrystal/general-stanley-mcchrystal-how-to-lead-resilient-teams-through-uncertainty.html"
      },
      {
        "title": "Bold Leader Spotlight: Stanley McChrystal, Founder of McChrystal Group",
        "url": "https://www.boldbusiness.com/human-achievement/stanley-mcchrystal-founder-mcchrystal-group-bold-leader/"
      },
      {
        "title": "General Stanley McChrystal: Why The Toughest Bosses Have The Most Devoted Employees",
        "url": "https://www.inc.com/leigh-buchanan/stanley-mcchrystal-tough-bosses-loyal-employees.html"
      },
      {
        "title": "20 Keynote Speakers For Your Leadership Meetings",
        "url": "https://www.leadingauthorities.com/blog/speakers-your-leadership-meetings"
      },
      {
        "title": "Management lessons from an American general - Stanley McChrystal advises blue-chip firms to give junior staff more power",
        "url": "https://www.economist.com/news/business/21721954-stanley-mcchrystal-advises-blue-chip-firms-give-junior-staff-more-power-management-lessons"
      },
      {
        "title": "Blue State Blues: Obama Fired Stanley McChrystal for Less Than Trump Fired Comey",
        "url": "https://www.breitbart.com/big-government/2017/05/12/comey-blue-state-blues-obama-fired-mcchrystal-for-less-than-trump-fired/"
      },
      {
        "title": "How Stanley McChrystal Teaches Yale Students To Lead",
        "url": "https://www.forbes.com/sites/monicawang/2016/06/24/how-stanley-mcchrystal-teaches-yale-students-to-lead/#2066437b362f"
      },
      {
        "title": "FiscalNote Board of Directors Adds Former U.S. Army General Stanley McChrystal",
        "url": "https://washingtonexec.com/2016/03/fiscalnote-board-directors-adds-former-u-s-army-general-stanley-mcchrystal/"
      },
      {
        "title": "Stanley McChrystal: What The Army Can Teach You About Leadership",
        "url": "https://www.forbes.com/sites/danschawbel/2015/07/13/stanley-mcchrystal-what-the-army-can-teach-you-about-leadership/#64c7655352ce"
      },
      {
        "title": "Gen. Stanley McChrystal’s Military Rules for Leading Your Business",
        "url": "https://www.success.com/article/gen-stanley-mcchrystals-military-rules-for-leading-your-business"
      },
      {
        "title": "The general who led a new kind of warfare to take on Al-Qaeda",
        "url": "https://www.wired.co.uk/article/new-art-of-business"
      },
      {
        "title": "Zero Dark Thirty Inc.",
        "url": "https://www.newsweek.com/2014/03/14/zero-dark-inc-247959.html"
      },
      {
        "title": "General Stanley McChrystal: How the Military Can Teach Us to Adapt",
        "url": "https://time.com/3904177/mcchrystal-team-of-teams/"
      },
      {
        "title": "Highlights from Our Live Q&A with Gen. Stanley McChrystal, David Silverman, and Chris Fussell",
        "url": "https://www.fastcompany.com/3046746/highlights-from-our-live-qa-with-gen-stanley-mcchrystal-david-silverman-and"
      },
      {
        "title": "Stanley McChrystal on how to shake up the military",
        "url": "https://www.washingtonpost.com/blogs/on-leadership/wp/2015/05/15/gen-stanley-mcchrystal-on-shaking-up-the-military/"
      },
      {
        "title": "Let General Stanley McChrystal Explain Why Adaptability Trumps Hierarchy",
        "url": "https://www.fastcompany.com/3045477/goodbye-org-chart"
      },
      {
        "title": "Don't Take Shortcuts, Even When No One Is Looking​",
        "url": "https://www.linkedin.com/pulse/i-were-22-dont-take-shortcuts-even-when-one-looking-stan-mcchrystal?t="
      },
      {
        "title": "The only way to defeat the Islamic State",
        "url": "https://www.washingtonpost.com/opinions/the-only-way-to-defeat-the-islamic-state/2014/09/05/4b2d7bd4-3459-11e4-a723-fa3895a25d02_story.html"
      },
      {
        "title": "Behaving ethically in the Internet Age",
        "url": "https://fortune.com/2014/07/15/brainstorm-tech-ethics-panel/"
      },
      {
        "title": "It’s Time for Obama to Heed McChrystal’s Call for the ‘Service Year’",
        "url": "https://www.thedailybeast.com/articles/2014/06/23/it-s-time-for-obama-to-heed-mcchrystal-s-call-for-the-service-year.html"
      },
      {
        "title": "If I Were 22: A Life of Service",
        "url": "https://www.linkedin.com/pulse/20140519230721-86145090-if-i-were-22-a-life-of-service"
      },
      {
        "title": "5 Best Business Books",
        "url": "https://fortune.com/2015/11/17/best-entrepreneurial-business-books/"
      },
      {
        "title": "What VW can learn from Gen. Stanley McChrystal about imperfect leaders",
        "url": "https://fortune.com/2015/10/14/volkswagen-emissions-scandal-general-stanley-mcchrystal-leadership/"
      },
      {
        "title": "Experts on Today’s Top Topics in Leadership",
        "url": "https://www.leadingauthorities.com/blog/experts-todays-top-topics-leadership"
      },
      {
        "title": "Don't Take My Word for It... Fortune's \"Top 5 Best Business Books\"",
        "url": "https://www.leadingauthorities.com/blog/dont-take-my-word-it-fortunes-top-5-best-business-books"
      },
      {
        "title": "Gen McChrystal: Best-Selling “Team of Teams” Book Out",
        "url": "https://www.leadingauthorities.com/blog/gen-mcchrystal-best-selling-team-teams-book-out"
      },
      {
        "title": "Gen. Stanley McChrystal: Essential Advice, Busy Calendar",
        "url": "https://www.leadingauthorities.com/blog/gen-stanley-mcchrystal-essential-advice-busy-calendar"
      },
      {
        "title": "General McChrystal On Breakthrough Leadership",
        "url": "https://www.leadingauthorities.com/blog/general-mcchrystal-breakthrough-leadership"
      },
      {
        "title": "General McChrystal on Effective Communications",
        "url": "https://www.leadingauthorities.com/blog/general-mcchrystal-effective-communications"
      },
      {
        "title": "General McChrystal & Jeff Eggers Release New Book, Leaders: Myth and Reality",
        "url": "https://www.leadingauthorities.com/blog/general-mcchrystal-jeff-eggers-release-new-book-leaders-myth-and-reality"
      },
      {
        "title": "Leadership Legend General Stanley McChrystal",
        "url": "https://www.leadingauthorities.com/blog/leadership-legend-general-stanley-mcchrystal"
      },
      {
        "title": "McChrystal on Applying War Lessons to Business",
        "url": "https://www.leadingauthorities.com/blog/mcchrystal-applying-war-lessons-business"
      },
      {
        "title": "Now Available for Virtual Events: McChrystal Group on Leading Through Uncertainty",
        "url": "https://www.leadingauthorities.com/blog/mcchrystal-group-leading-through-uncertainty"
      },
      {
        "title": "McChrystal: One Of LAI's Most-Booked Speakers",
        "url": "https://www.leadingauthorities.com/blog/mcchrystal-one-lais-most-booked-speakers-1"
      },
      {
        "title": "New Book: Gen. Stanley McChrystal on Mastering Risk",
        "url": "https://www.leadingauthorities.com/node/20862"
      },
      {
        "title": "New Book from No. 1 Leadership Speaker",
        "url": "https://www.leadingauthorities.com/blog/new-book-no-1-leadership-speaker"
      },
      {
        "title": "Podcasts For Your Morning Commute",
        "url": "https://www.leadingauthorities.com/blog/podcasts-your-morning-commute"
      },
      {
        "title": "Gen. Stanley McChrystal on what would close the divide in America",
        "url": "https://www.cbsnews.com/news/general-stanley-mcchrystal-on-national-service/"
      },
      {
        "title": "Retired Army generals join nonprofit that urges public to recommit to democracy",
        "url": "https://www.aol.com/retired-army-generals-join-nonprofit-142932823.html"
      }
    ],
    "social_media": {
      "twitter": "https://twitter.com/StanMcChrystal"
    },
    "speaker_fees": {},
    "speaker_image_url": "https://www.leadingauthorities.com/sites/default/files/styles/600x400/public/images/mcchrystal-stanley-speaker-new.original.jpg",
    "speaker_website": "https://www.mcchrystalgroup.com/",
    "topics": [
      {
        "title": "Lessons in Leadership.",
        "description": "In dynamic presentations on leadership, General Stan McChrystal shares lessons based on leading and innovating one of the world’s largest organizations. Modern warfare and business demand the same no-nonsense leadership that drives change and implements it across large organizations. He reveals the power of culture, communication, and relationships, sharing stories, experiences, and principles that make his points. McChrystal addresses such key leadership principles as transparency and inclusion, leveraging the power of teams through relationships, leading by influence, relentless mission focus, and sharing a clear vision with everyone who must execute against it."
      },
      {
        "title": "Team of Teams: New Rules of Engagement for a Complex World.",
        "description": "In this captivating presentation on the significance of teamwork, Gen. McChrystal draws on research conducted for hisNew York Timesbest-sellerTeam of Teams, along with examples from his time leading extremely high-performing teams in wartime, to provide a 360-degree view of the role teamwork plays in today’s success equation. Hitting on the many ingredients of effective teamwork including transparent communication and a decentralized power network that allows for split-second, empowered decision-making, McChrystal’s compelling insights and thought-provoking examples pave the way for real transformation at organizations large and small."
      },
      {
        "title": "On Character: Choices That Define a Life.",
        "description": "In this compelling new keynote drawn from his forthcoming book, On Character: Choices That Define a Life, Gen. Stanley McChrystal examines the leadership behaviors that build trust, inspire teams, and drive long-term success. Through vivid storytelling—from his formative years at West Point to leading during moments of national crisis—McChrystal unpacks the choices and habits that enable leaders to meet challenges with clarity, consistency, and courage. These insights offer a practical blueprint for cultivating resilient, high-performing teams rooted in accountability and aligned action. These principles also lay the foundation for his best-selling Team of Teams, showing how shared values unlock adaptability and cohesion at scale. With relevance across industries, McChrystal delivers a timely message on what it truly takes to lead effectively in today’s complex, evolving landscape."
      },
      {
        "title": "Understanding Risk & Mastering the Unknown.",
        "description": "Retired four-star general Stan McChrystal has lived a life associated with the deadly risks of combat. From his first day at West Point, to his years in Afghanistan, to his efforts helping business leaders navigate a global pandemic, McChrystal has seen how individuals and organizations fail to mitigate risk. Why? Because they focus on the probability of something happening instead of the interface by which it can be managed.\nIn this talk, adapted from his book,Risk: A User’s Guide, McChrystal offers an entirely new way to understand risk and master the unknown – focused not on odds, but on a readiness to respond – and shares his battle-tested system for detecting and responding to risk. Using real-life examples from his military experiences and the business world, he illustrates the dimensions of control that organizations can use to maintain healthy Risk Immune Systems and identify, analyze, and exert mastery over any type of risk they might face."
      },
      {
        "title": "Conversation with the McChrystal Group: Practical Advice for Leadership in Crisis.",
        "description": "A four-star general, Stanley McChrystal is widely credited with revolutionizing warfare by fusing intelligence and operations - leading more than 150,000 troops through a virtual command base. Serving on McChrystal’s senior staff, former U.S. Navy Seal Chris Fussell observed leading through crisis first-hand, leveraging digital platforms to drive effective action across the globe. Together, they now lead the leadership consulting group McChrystal Group and are offeringa pre-recorded webinar talk on practical tactics for leading through a crisis– that you can distribute to your audience to watch at their convenience. You can then book a30-45 minute live or virtual discussionwith General McChrystal or Chris Fussell for your group to discuss the material and how they can apply these insights to leadership challenges in their own operating environments."
      },
      {
        "title": "The Changing Geopolitical Landscape.",
        "description": "Few people have as much insight on the current state of national and global affairs as General McChrystal. In this insightful presentation, he examines today’s most pressing questions regarding the dynamic geopolitical environment. He investigates and analyzes the trends, relationships, and forces that shape the world. He details the implications that these factors will have on the security, politics, energy, and the global population."
      },
      {
        "title": "Moderated Conversations on Leadership or Geopolitical Issues.",
        "description": "For the right audiences, General McChrystal will have a conversation with a moderator or business leader that leads to custom insights and dynamic wide-ranging conversations tailored to the audience. This intimate format lends itself to McChrystal’s candid insights, responses, and stories, which draw the audience in and make them part of the dialogue. From lessons learned to observations on current events and the future, McChrystal shares perspectives gained through one of the most legendary military careers, as well as his experiences with business, teaching, and public service.\nContinue Reading »"
      }
    ],
    "topics_and_types": [
      {
        "name": "Leadership",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:4"
      },
      {
        "name": "Middle East",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:41"
      },
      {
        "name": "National Security",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:23"
      },
      {
        "name": "Relationship Building",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:45"
      },
      {
        "name": "Teamwork & Collaboration",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:50"
      },
      {
        "name": "Decision Making",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:34"
      },
      {
        "name": "Change Management",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:13"
      },
      {
        "name": "Corporate Culture",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:7"
      },
      {
        "name": "Crisis Management",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:21"
      },
      {
        "name": "Geopolitics",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:17"
      },
      {
        "name": "Authors",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:56"
      },
      {
        "name": "College & University Speakers",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:74"
      },
      {
        "name": "Military Leaders",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:62"
      },
      {
        "name": "TED Speakers",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:54"
      }
    ],
    "videos": [
      {
        "title": "Stanley McChrystal: The General's Guide to Becoming a Team of Teams",
        "video_id": "2voQTgDvv21R916bB9qaej",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/stanley-mcchrystal-generals-guide-becoming-team-teams",
        "thumbnail_url": "https://play.vidyard.com/2voQTgDvv21R916bB9qaej.jpg"
      },
      {
        "title": "Insights on Geopolitics",
        "video_id": "JnJnfU3xKsy5E772KTTMqy",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/stanley-mcchrystal-geopolitical-landscape",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/jnjnfu3xksy5e772kttmqy.original.jpg"
      },
      {
        "title": "Gen. Stan McChrystal's TED Talk: Insights On Leadership",
        "video_id": "DVfLrfde4JWVZpYHsMp5xY",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/gen-stan-mcchrystals-ted-talk-insights-leadership",
        "thumbnail_url": "https://play.vidyard.com/DVfLrfde4JWVZpYHsMp5xY.jpg"
      },
      {
        "title": "The military case for sharing knowledge",
        "video_id": "9jRkACywckE",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/stanley-mcchrystal-military-case-sharing-knowledge",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/9jrkacywcke.original.jpg"
      },
      {
        "title": "Gen. Stanley McChrystal: Plywood Leadership",
        "video_id": "LF8oYc8R4qg2XJJRvsDMXd",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/gen-stanley-mcchrystal-plywood-leadership",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/lf8oyc8r4qg2xjjrvsdmxd.original.jpg"
      }
    ]
  },
  {
    "_id": "687640fe26a2e74b39bebafb",
    "speaker_page_url": "https://www.leadingauthorities.com/speakers/marci-rossell",
    "books_and_publications": [],
    "client_testimonials": [
      {
        "quote": "Marci is a total homerun. She is the kind of speaker I wish I could use at every single meeting. We will definitely have her back again.",
        "author": "American Resort Development Association"
      },
      {
        "quote": "Marci was well received by all of our guests. She made a complex topic both interesting and digestible to a variety of audience members (students, faculty, alumni, business members, etc.). We would definitely recommend her!",
        "author": "San Diego State University"
      },
      {
        "quote": "Marci has a contagious energy about her which makes her easy to follow. She’s an expert at keeping her audience engaged. I’ve never seen another economist like her. She’s a true gem!",
        "author": "American Land Title Association"
      },
      {
        "quote": "Marci’s message was optimistic, informative, and down to earth. She did great as a virtual speaker with no issue on communication and energy. She also responded well to questions from the group. We were glad to have her!”",
        "author": "HLB International"
      }
    ],
    "description": "Marci Rossell is a world-renowned economist and financial expert who electrifies audiences nationwide, speaking candidly on the nexus of economics, politics, culture, and the media. She honed her animated style serving as the popular, lively Chief Economist for CNBC, where she became a household name and a must-watch source of financial news. The former co-host of the well-known “pre-market” morning news and talk show Squawk Box, Rossell is revered for taking complex economic issues, often dull in the button-down business press, and making them relevant to people's lives, families, and careers.\n\nExclusively represented by Leading Authorities speakers bureau, she discusses America’s current and future role in the global economy, factors responsible for recessions, how Washington influences Wall Street and the markets, and the specific forecast for the U.S. economy over the course of the next 18-24 months. She is also well-versed in the stock market, investor behavior, consumer confidence, and what accountable capitalism looks like this year and beyond. With a knack for making complex topics more digestible, Rossell’s authentic, high-energy talks deliver a stimulating and often optimistic economic outlook, providing an insider’s perspective on key factors of economic disruption. Her creative, thought-provoking commentary will ring in the audience members' ears well after she leaves the stage.\n\nPrior to her career in broadcast journalism, Marci served as Corporate Economist and Investment Spokesperson for OppenheimerFunds, one of the nation’s largest mutual fund companies. Her success in the private sector led to her economic commentary being revered and ultimately her appointments on nationally syndicated talk shows. Before moving to Wall Street, she was an expert witness for Deloitte & Touche in court cases involving economic issues. Marci began her career as an economist with the Federal Reserve Bank of Dallas.\n\nMarci earned a Ph.D. in Economics from Southern Methodist University, where she was named one of the Young Alumni of the Year in 2002. She brings a world of experience — from Main Street to Wall Street — when discussing the U.S. economy, international events, and movements in capital markets.",
    "download_profile_link": "https://www.leadingauthorities.com/print/view/pdf/speaker/bio?view_args[]=17108",
    "download_topics_link": "https://www.leadingauthorities.com/print/view/pdf/speaker/topic?view_args[]=17108",
    "job_title": "Expert Economic Forecaster, Former Chief Economist for CNBC and Co-Host of Squawk Box",
    "name": "Marci Rossell",
    "recent_news": [
      {
        "title": "Economist Marci Rossell: No Recession Imminent",
        "url": "https://www.acec.org/news/last-word-blog/post/economist-marci-rossell-no-recession-imminent/"
      },
      {
        "title": "Hear From One of The Most Trusted Economists, Dr. Marci Rossell",
        "url": "https://www.leadingauthorities.com/blog/one-most-trusted-economists-cnbcs-highest-rated-forecaster-dr-marci-rossell"
      },
      {
        "title": "Unique and Diverse Economic Industry Voices For Your Next Event",
        "url": "https://www.leadingauthorities.com/blog/unique-and-diverse-economic-industry-voices-your-next-event"
      },
      {
        "title": "Speakers on Post-Pandemic Realities",
        "url": "https://www.leadingauthorities.com/blog/speakers-post-pandemic-realities"
      },
      {
        "title": "Dr. Marci Rossell: Expert Economic Forecaster on Coronavirus's Economic Impact",
        "url": "https://www.leadingauthorities.com/blog/dr-marci-rossell-coronavirus-economic-impact"
      },
      {
        "title": "What CRE Investors Should Expect: NAIOP Keynoter",
        "url": "https://www.commercialsearch.com/news/economic-forecaster-at-naiop-what-cre-investors-can-expect/"
      }
    ],
    "social_media": {},
    "speaker_fees": {
      "Local": "$20,001 - $35,000*",
      "US East": "$35,001 - $55,000*",
      "US West": "$35,001 - $55,000*",
      "Europe": "$35,001 - $55,000*",
      "Asia": "$55,001 - $75,000*"
    },
    "speaker_image_url": "https://www.leadingauthorities.com/sites/default/files/styles/650x430/public/images/rossell-marci-speaker.original.jpg",
    "speaker_website": null,
    "topics": [
      {
        "title": "The Economy 2025: Tax Cuts, Deregulation, and Tariffs Drive the Agenda",
        "description": ". One of the most trusted names in financial reporting and economics, Dr. Rossell will bring you the global economic outlook against the backdrop of policy change in Washington. Economies will adjust to a world of less trade and a stronger dollar, as the Federal Reserve deals with the return of inflationary pressures. The year will also see China struggling to reignite growth amidst long-term demographic challenges and AI continuing to shake up the business world. Join Marci for all this, and much, much more."
      },
      {
        "title": "Economic Forecast: Impact of Seismic Surprises.",
        "description": "One of the most trusted names in financial reporting and economics, Dr. Rossell delivers a U.S. economic outlook for the next 18-24 months. Drawing on history, theory, and her ringside seat to Wall Street, she delivers an insider’s perspective on the most important economic events of our time and discusses the impact of key factors like the inflation, supply chain disruptions, labor shortages and the possibility of a recession. Get an informed outlook into the coming year and understand new opportunities that are on the horizon. Dr. Rossell outlines the current state of the economy, explaining monetary policy, movements in the stock market, oil prices and the real estate market.  She highlights that current conditions are symptomatic of a larger trend: that businesses today face a variety of seismic surprises, including cyberterrorism, environmental disasters, swings in the regulatory regime, and, yes, pandemics as well."
      },
      {
        "title": "Global Economic Outlook: Opportunities for Growth.",
        "description": "Join Dr. Marci Rossell as she explains what has caused a slowing in global growth. She looks at the implications of the current “wait and see” mentality of both businesses and consumers, China and India’s new roles on the world stage, the rise of Millennials, and the emergence of cheap energy, among other factors."
      },
      {
        "title": "Can the Center Hold? Navigating Economic and Geopolitical Risks in the Next Decade.",
        "description": "As global tensions rise, and the stability of the post-Cold War world order begins to unravel. Businesses are facing unprecedented challenges from trade disputes, geopolitical conflicts in regions like Ukraine, Sudan, and Gaza, and the growing impact of \"Cool\" Wars creating disruptions to supply chains and local economies. Dr. Marci Rossell breaks down these global dynamics in a clear, approachable way, offering actionable insights on how businesses can adapt and thrive amid uncertainty. Her expert analysis helps leaders understand the economic risks ahead and develop strategies to navigate this new global landscape with confidence."
      },
      {
        "title": "The Stock Market, the Investor, and the Media.",
        "description": "A prior Wall Street economist and the former CNBC Chief Economist and co-host of Squawk Box, Dr. Marci Rossell is uniquely positioned to discuss the ins and outs of the media’s relationship with the economy. In her forward-looking talk, Dr. Rossell pulls back the curtain on the way public figures and journalism influence buying power, investor behavior, and consumer confidence and offers a preview of what’s to come in our increasingly social-media-reliant world."
      },
      {
        "title": "The New Corporate Citizen: Social Responsibility, Business Ethics, and Accountable Capitalism.",
        "description": "Can capitalism survive the 21st century? With this talk, Dr. Rossell looks at the shortcomings of the current economic system as well as the rapid growth of movements that challenge a capitalism worldview. She considers who is responsible for the growing public distrust of economic institutions as well as how financial crises can be prevented in the future.\nContinue Reading »"
      }
    ],
    "topics_and_types": [
      {
        "name": "International Business",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:38"
      },
      {
        "name": "Economic Outlook",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:9"
      },
      {
        "name": "Finance Policy & Regulation",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=topics:32"
      },
      {
        "name": "Female Speakers",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:70"
      },
      {
        "name": "Media",
        "url": "https://www.leadingauthorities.com/speaker-search?f[0]=types:63"
      }
    ],
    "videos": [
      {
        "title": "Economic Forecast: Impact of Seismic Surprises",
        "video_id": "3JbjS1GQk2MoHU1DLhG16o",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/marci-rossell-economic-forecast-impact-seismic-surprises",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/2023-07/rossell-marci-economic-forecast-thumbnail.jpg"
      },
      {
        "title": "Marci Rossell: The COVID-19 Economy",
        "video_id": "EDWpoPEJNoWLx9t9V4aBLA",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/marci-rossell-covid-19-economy",
        "thumbnail_url": "https://play.vidyard.com/EDWpoPEJNoWLx9t9V4aBLA.jpg"
      },
      {
        "title": "The Coronavirus' Economic Impact",
        "video_id": "9JUrhZZBKBoyTRTwdumVsm",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/marci-rossell-coronavirus-economic-impact",
        "thumbnail_url": "https://play.vidyard.com/9JUrhZZBKBoyTRTwdumVsm.jpg"
      },
      {
        "title": "Effects on the U.S. Economy",
        "video_id": "Ze83wNSf7asoxDuLiEbXEp",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/marci-rossell-effects-us-economy",
        "thumbnail_url": "https://play.vidyard.com/Ze83wNSf7asoxDuLiEbXEp.jpg"
      },
      {
        "title": "The Forces Fueling the US Economy",
        "video_id": "9yRvKeEeFLAX6gwrvp36bw",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/dr-marci-rossell-forces-fueling-us-economy",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/9yrvkeeeflax6gwrvp36bw.original.jpg"
      },
      {
        "title": "Marci Rossell: Expert Economic Insights for 2020",
        "video_id": "JCCzybCbaxUGpysVgaejue",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/marci-rossell-expert-economic-insights-2020",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/jcczybcbaxugpysvgaejue.original.jpg"
      },
      {
        "title": "Dr. Marci Rossell: American Society of Civil Engineers (ASCE) Convention Keynote Presentation",
        "video_id": "ogZj3fPYR78",
        "video_page_url": "https://www.leadingauthorities.com/speakers/video/dr-marci-rossell-american-society-civil-engineers-asce-convention-keynote",
        "thumbnail_url": "https://www.leadingauthorities.com/sites/default/files/images/ogzj3fpyr78.original.jpg"
      }
    ]
  }
]